{
  "personalInfo": {
    "name": "Tamara Rivas",
    "title": "Back-End Developer",
    "location": "Chillan, Chile",
    "email": "tam.trivas@gmail.com",
    "socials": [
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/tamara-rivas-backend/",
        "icon": "Linkedin"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/tam-rivasl",
        "icon": "Github"
      }
    ],
    "about": "I am a technology-driven professional with experience in frontend development using React and backend frameworks like NestJs and Spring Boot. I excel in solving complex challenges with creativity and determination. Constantly expanding my skills, I’m also passionate about exploring emerging fields like machine learning and data science. My goal is to contribute to innovative projects in a collaborative and adaptable environment."
  },
  "sections": {
    "about": "About",
    "experience": "Work Experience",
    "education": "Education",
    "skills": "Skills",
    "projects": "Projects"
  },
  "experience": [
    {
      "role": "Full Stack Developer / Backend Developer",
      "company": "Evolvetech Spa (Formerly Stratech)",
      "period": "May 2023 - Present",
      "description": [
        "Designed, developed, and maintained backend systems using microservices architecture.",
        "Collaborated with cross-functional teams to integrate third-party services and ensure regulatory compliance.",
        "Used frontend technologies to implement and improve user-facing features.",
        "Followed agile methodologies (Scrum) for project management and task prioritization.",
        "Ensured smooth operation and scalability of backend services through proactive monitoring and maintenance.",
        "Led the integration of Betby, enabling seamless sportsbook operations, including bet placement and result tracking.",
        "Integrated Sumsub for user verification across multiple countries, ensuring compliance with international regulatory standards.",
        "Played a pivotal role in resolving blockers for the development team, leading to faster project completion and improved workflow.",
        "Contributed to the scalability of backend systems by maintaining and expanding microservices using Nest.js and Spring Boot."
      ]
    },
    {
      "role": "Full Stack Developer",
      "company": "Stratech",
      "period": "Jul 2022 - May 2023",
      "description": [
        "Worked as part of a contingency team, resolving production issues and managing urgent tickets to ensure smooth casino platform operations.",
        "Developed and maintained frontend features using Next.js, React.js, and Ant Design.",
        "Designed and developed a business dashboard with Retool, incorporating permission hierarchies.",
        "Implemented leaderboards using Strapi to boost user engagement and platform interaction.",
        "Participated in agile practices, using Scrum methodologies and tools like Jira for task tracking.",
        "Integrated the FreeSpins feature for casino games, increasing user engagement and retention.",
        "Resolved critical production issues in a high-pressure environment, ensuring platform stability and minimizing downtime.",
        "Designed and developed a business dashboard with role-based permission control using Retool, streamlining internal operations.",
        "Implemented leaderboards using Strapi, which led to a noticeable increase in user interaction within the casino platform.",
        "Enhanced the frontend experience by resolving issues with Next.js and React.js, improving overall user interface performance."
      ]
    }
  ],
  "education": [
    {
      "degree": "Computational Programmer Analyst",
      "institution": "Duoc Uc University",
      "period": "2021 - 2024"
    }
  ],
  "skills": [
    { "name": "Nest.js", "level": 85 },
    { "name": "Spring Boot", "level": 80 },
    { "name": "PostgreSQL", "level": 75 },
    { "name": "Docker", "level": 70 },
    { "name": "Next.js", "level": 75 },
    { "name": "React.js", "level": 80 },
    { "name": "TypeScript", "level": 85 },
    { "name": "JavaScript", "level": 90 }
  ],
  "projects": [
    {
      "name": "Personal Portfolio",
      "description": "A personal portfolio website to showcase my projects and skills.",
      "tags": [
        "React",
        "Tailwind CSS"
      ],
      "link": "https://johndoe.dev"
    },
    {
      "name": "Weather App",
      "description": "A web application that provides weather information for any location.",
      "tags": [
        "JavaScript",
        "OpenWeatherMap API"
      ],
      "link": "https://weatherapp.com"
    },
    {
      "name": "Task Manager",
      "description": "A simple task management app to keep track of daily tasks.",
      "tags": [
        "Node.js",
        "MongoDB"
      ],
      "link": "https://taskmanager.com"
    },
    {
      "name": "E-commerce Site",
      "description": "An online store built with Next.js and Stripe for payment processing.",
      "tags": [
        "Next.js",
        "Stripe"
      ],
      "link": "https://ecommerce.com"
    }
  ]
}
