{
  "personalInfo": {
    "name": "Tamara Rivas",
    "title": "Desarrolladora Back-End",
    "location": "Chillán, Chile",
    "email": "tam.trivas@gmail.com",
    "socials": [
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/tamara-rivas-backend/",
        "icon": "Linkedin"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/tam-rivasl",
        "icon": "Github"
      }
    ],
    "about": "Soy una profesional enfocada en la tecnología con experiencia en desarrollo frontend usando React y frameworks backend como NestJs y Spring Boot. Me destaco en resolver desafíos complejos con creatividad y determinación. Constantemente amplío mis habilidades y también tengo pasión por explorar campos emergentes como el aprendizaje automático y la ciencia de datos. Mi objetivo es contribuir a proyectos innovadores en un entorno colaborativo y adaptable."
  },
  "sections": {
    "about": "Sobre Mí",
    "experience": "Experiencia Laboral",
    "education": "Educación",
    "skills": "Habilidades",
    "projects": "Proyectos"
  },
  "experience": [
    {
      "role": "Desarrolladora Full Stack / Back-End",
      "company": "Evolvetech Spa (Anteriormente Stratech)",
      "period": "May 2023 - Presente",
      "description": [
        "Diseñé, desarrollé y mantuve sistemas backend utilizando una arquitectura de microservicios.",
        "Colaboré con equipos multifuncionales para integrar servicios de terceros y garantizar el cumplimiento normativo.",
        "Utilicé tecnologías frontend para implementar y mejorar funciones orientadas al usuario.",
        "Seguí metodologías ágiles (Scrum) para la gestión de proyectos y la priorización de tareas.",
        "Aseguré el correcto funcionamiento y escalabilidad de los servicios backend mediante monitoreo y mantenimiento proactivo.",
        "Lideré la integración de Betby, permitiendo operaciones deportivas sin problemas, incluyendo la realización de apuestas y el seguimiento de resultados.",
        "Integré Sumsub para la verificación de usuarios en varios países, asegurando el cumplimiento de las normativas internacionales.",
        "Jugué un papel clave en la resolución de bloqueos para el equipo de desarrollo, lo que llevó a una finalización más rápida de los proyectos y una mejora en el flujo de trabajo.",
        "Contribuí a la escalabilidad de los sistemas backend manteniendo y expandiendo microservicios utilizando Nest.js y Spring Boot."
      ]
    },
    {
      "role": "Desarrolladora Full Stack",
      "company": "Stratech",
      "period": "Jul 2022 - May 2023",
      "description": [
        "Trabajé como parte de un equipo de contingencia, resolviendo problemas de producción y gestionando tickets urgentes para asegurar el correcto funcionamiento de la plataforma de casino.",
        "Desarrollé y mantuve características frontend utilizando Next.js, React.js y Ant Design.",
        "Diseñé y desarrollé un panel de control empresarial con Retool, incorporando jerarquías de permisos.",
        "Implementé tablas de clasificación con Strapi para aumentar el compromiso y la interacción de los usuarios con la plataforma.",
        "Participé en prácticas ágiles, utilizando metodologías Scrum y herramientas como Jira para el seguimiento de tareas.",
        "Integré la funcionalidad de FreeSpins para juegos de casino, aumentando el compromiso y la retención de usuarios.",
        "Resolví problemas críticos de producción en un entorno de alta presión, asegurando la estabilidad de la plataforma y minimizando el tiempo de inactividad.",
        "Diseñé y desarrollé un panel de control empresarial con control de permisos basado en roles utilizando Retool, lo que optimizó las operaciones internas.",
        "Implementé tablas de clasificación con Strapi, lo que llevó a un aumento notable en la interacción de los usuarios dentro de la plataforma de casino.",
        "Mejoré la experiencia frontend resolviendo problemas con Next.js y React.js, mejorando el rendimiento general de la interfaz de usuario."
      ]
    }
  ],
  "education": [
    {
      "degree": "Analista Programador Computacional",
      "institution": "Universidad Duoc UC",
      "period": "2021 - 2024"
    }
  ],
  "skills": [
    { "name": "Nest.js", "level": 85 },
    { "name": "Spring Boot", "level": 80 },
    { "name": "PostgreSQL", "level": 75 },
    { "name": "Docker", "level": 70 },
    { "name": "Next.js", "level": 75 },
    { "name": "React.js", "level": 80 },
    { "name": "TypeScript", "level": 85 },
    { "name": "JavaScript", "level": 90 }
  ],
  "projects": [
    {
      "name": "Portafolio Personal",
      "description": "Un sitio web de portafolio personal para mostrar mis proyectos y habilidades.",
      "tags": [
        "React",
        "Tailwind CSS"
      ],
      "link": "https://johndoe.dev"
    },
    {
      "name": "Aplicación del Clima",
      "description": "Una aplicación web que proporciona información meteorológica para cualquier ubicación.",
      "tags": [
        "JavaScript",
        "OpenWeatherMap API"
      ],
      "link": "https://weatherapp.com"
    },
    {
      "name": "Administrador de Tareas",
      "description": "Una aplicación simple para la gestión de tareas diarias.",
      "tags": [
        "Node.js",
        "MongoDB"
      ],
      "link": "https://taskmanager.com"
    },
    {
      "name": "Sitio de Comercio Electrónico",
      "description": "Una tienda en línea construida con Next.js e integración de pagos con Stripe.",
      "tags": [
        "Next.js",
        "Stripe"
      ],
      "link": "https://ecommerce.com"
    }
  ]
}
